{
  "findings": [
    {
      "risk_title": "Indefinite Confidentiality Obligation",
      "severity": "HIGH",
      "rationale": "The obligation to maintain confidentiality indefinitely may lead to excessive liability for the employee, who may be unsure about how long they are bound by these terms.",
      "evidence_quote": "Employee agrees to maintain strict confidentiality of all security protocols, vulnerabilities, and proprietary systems indefinitely, without expiration."
    },
    {
      "risk_title": "Broad Indemnification Clause",
      "severity": "HIGH",
      "rationale": "The employee's indemnification for all claims without limitation can expose them to significant financial risk, regardless of the circumstances of the claims.",
      "evidence_quote": "Employee shall indemnify Employer for all claims, damages, and expenses, without limitation, arising from Employee's security work or breach of confidentiality."
    },
    {
      "risk_title": "Three-Year Non-Compete Period",
      "severity": "MEDIUM",
      "rationale": "A three-year non-compete clause may hinder the employee's ability to find new employment in their field, impacting their career and income potential.",
      "evidence_quote": "Employee shall not work for competitors or disclose security information for 3 years following termination."
    },
    {
      "risk_title": "Employer's Immediate Termination Rights",
      "severity": "MEDIUM",
      "rationale": "The ability for the employer to terminate the agreement immediately upon a security breach could lead to job insecurity for the employee.",
      "evidence_quote": "Employer may terminate immediately upon security breach."
    },
    {
      "risk_title": "California Governing Law",
      "severity": "LOW",
      "rationale": "Choosing California law may not favor the employee depending on their location, but it's a common practice in agreements.",
      "evidence_quote": "This Agreement is governed by California law, and parties submit to exclusive jurisdiction in California courts."
    }
  ],
  "executed": true
}