{
  "findings": [
    {
      "risk_title": "Indefinite Confidentiality Obligation",
      "severity": "HIGH",
      "rationale": "The lack of a time limitation on the confidentiality obligation may expose the employee to perpetual liability, which is uncommon and can deter future employment opportunities.",
      "evidence_quote": "Employee agrees to maintain strict confidentiality of all proprietary information, trade secrets, and business strategies indefinitely, without any time limitation."
    },
    {
      "risk_title": "Broad Indemnification Clause",
      "severity": "HIGH",
      "rationale": "The indemnification clause requires the employee to cover all claims without limitation, which can place significant financial burden on the employee.",
      "evidence_quote": "Employee shall defend, indemnify, and hold harmless Employer from any and all claims, damages, losses, and expenses, without limitation."
    },
    {
      "risk_title": "Non-Compete Duration",
      "severity": "MEDIUM",
      "rationale": "A 3-year non-compete clause may be considered excessively long, potentially limiting the employee's future employment opportunities and may be unenforceable in some jurisdictions.",
      "evidence_quote": "Employee shall not engage in any competitive business activity or solicit Employer's employees or customers for a period of 3 years following termination."
    },
    {
      "risk_title": "Mandatory Arbitration Requirement",
      "severity": "MEDIUM",
      "rationale": "Mandatory binding arbitration can limit employees' rights to pursue claims in court, which may be perceived as unfavorable for the employee.",
      "evidence_quote": "All disputes must be resolved through mandatory binding arbitration under the rules of the American Arbitration Association."
    },
    {
      "risk_title": "Attorneys' Fees Provision",
      "severity": "MEDIUM",
      "rationale": "The clause allowing the employer to recover attorneys' fees can create a financial disincentive for the employee to enforce their rights under the agreement.",
      "evidence_quote": "In any action to enforce this Agreement, Employer shall be entitled to recover all attorneys' fees, court costs, and expenses from Employee."
    },
    {
      "risk_title": "Termination Without Cause",
      "severity": "MEDIUM",
      "rationale": "The employer's right to terminate the agreement at any time without cause may create job insecurity for the employee.",
      "evidence_quote": "Employer may terminate this Agreement at any time, with or without cause."
    }
  ],
  "executed": true
}