{
  "findings": [
    {
      "risk_title": "Intellectual Property Ownership",
      "severity": "HIGH",
      "rationale": "The complete assignment of all rights to the employer may limit the employee's future opportunities and could lead to disputes over ownership of work.",
      "evidence_quote": "All work product and deliverables created by Employee during employment shall be owned by Employer."
    },
    {
      "risk_title": "Length of Confidentiality Obligation",
      "severity": "MEDIUM",
      "rationale": "A four-year confidentiality period may be excessively long, potentially restricting the employee's future work opportunities.",
      "evidence_quote": "Employee agrees to maintain confidentiality of all proprietary testing methods and trade secrets for a period of 4 years after termination."
    },
    {
      "risk_title": "Non-Compete Duration",
      "severity": "HIGH",
      "rationale": "An 18-month non-compete clause could significantly hinder the employee's ability to find new employment in their field.",
      "evidence_quote": "Employee may not work for competitors for 18 months after termination within a 50-mile radius."
    },
    {
      "risk_title": "Indemnification Clause",
      "severity": "MEDIUM",
      "rationale": "The employee's obligation to indemnify the employer for claims could lead to substantial financial liability if disputes arise.",
      "evidence_quote": "Employee shall indemnify Employer for all claims arising from Employee's breach of this Agreement, up to $250,000."
    },
    {
      "risk_title": "Binding Arbitration Requirement",
      "severity": "MEDIUM",
      "rationale": "Requiring binding arbitration may limit the employee's ability to seek legal remedies in court, which could be disadvantageous.",
      "evidence_quote": "Disputes shall be resolved through binding arbitration."
    },
    {
      "risk_title": "Attorney's Fees Clause",
      "severity": "MEDIUM",
      "rationale": "The employer's right to recover attorneys' fees could deter the employee from pursuing legitimate disputes due to potential cost implications.",
      "evidence_quote": "Employer shall be entitled to recover reasonable attorneys' fees in any enforcement action."
    }
  ],
  "executed": true
}