{
  "findings": [
    {
      "risk_title": "Broad Intellectual Property Assignment",
      "severity": "HIGH",
      "rationale": "The assignment of all inventions and work product to the employer may limit the employee's ability to use personal skills or innovations developed during employment.",
      "evidence_quote": "All inventions and work product created by Employee during employment shall be assigned to Employer."
    },
    {
      "risk_title": "Long Confidentiality Period",
      "severity": "MEDIUM",
      "rationale": "A 5-year confidentiality obligation may be overly restrictive and can limit the employee's future employment opportunities.",
      "evidence_quote": "Employee must maintain confidentiality of all proprietary information for a period of 5 years after termination."
    },
    {
      "risk_title": "Restrictive Non-Compete Clause",
      "severity": "HIGH",
      "rationale": "The 12-month non-compete restriction within a 25-mile radius could severely limit the employee's future job prospects.",
      "evidence_quote": "Employee agrees not to work for competitors for 12 months after termination within a 25-mile radius."
    },
    {
      "risk_title": "Indemnification for Breach",
      "severity": "MEDIUM",
      "rationale": "The indemnification clause places significant financial liability on the employee, which may deter them from taking necessary actions.",
      "evidence_quote": "Employee shall indemnify Employer for all claims arising from Employee's breach of this Agreement, up to $100,000."
    },
    {
      "risk_title": "Binding Arbitration Requirement",
      "severity": "MEDIUM",
      "rationale": "Requiring binding arbitration may limit the employee's legal recourse and may not be favorable compared to litigation.",
      "evidence_quote": "Disputes shall be resolved through binding arbitration."
    },
    {
      "risk_title": "Attorney's Fees Recovery",
      "severity": "MEDIUM",
      "rationale": "The clause allowing recovery of attorney's fees by the employer could discourage the employee from pursuing legitimate disputes.",
      "evidence_quote": "Employer shall be entitled to recover reasonable attorneys' fees in any enforcement action."
    }
  ],
  "executed": true
}