{
  "findings": [
    {
      "risk_title": "Broad Intellectual Property License",
      "severity": "HIGH",
      "rationale": "The perpetual and exclusive license may allow the employer to use the employee's work product indefinitely without additional compensation, which could lead to exploitation of the employee's creativity.",
      "evidence_quote": "Provider grants Employer a perpetual, exclusive license to use all work product created during employment for Employer's business purposes."
    },
    {
      "risk_title": "Extended Confidentiality Period",
      "severity": "MEDIUM",
      "rationale": "A 3-year confidentiality obligation post-termination may limit the employee's ability to work in their field and could be seen as overly restrictive.",
      "evidence_quote": "Confidentiality obligations survive termination and continue for 3 years."
    },
    {
      "risk_title": "Restrictive Non-Compete Clause",
      "severity": "HIGH",
      "rationale": "A 1-year non-compete clause within the same industry may significantly hinder the employee's future employment opportunities.",
      "evidence_quote": "Employee may not compete within the same industry for 1 year after termination, within Employer's service area."
    },
    {
      "risk_title": "Termination for Convenience",
      "severity": "MEDIUM",
      "rationale": "The ability for either party to terminate the agreement with only 30 days notice may create instability and uncertainty for the employee.",
      "evidence_quote": "Either party may terminate for convenience with 30 days written notice."
    },
    {
      "risk_title": "Limited Indemnification Scope",
      "severity": "MEDIUM",
      "rationale": "Capping indemnification at annual compensation may leave the employee vulnerable to significant claims or liabilities beyond their salary.",
      "evidence_quote": "Mutual indemnification: each party indemnifies the other for its own negligence, capped at annual compensation."
    }
  ],
  "executed": true
}